app/controllers/api/measurements_controller.rb

	def create
		@measurement = @user.measurements.build(measurement_params)
		if @measurement.save
---
INSERT INTO "measurements" ("user_id", "systolic_bp", "diastolic_bp", "pulse", "date_time", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def set_user
		@user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def set_measurement
		@measurement = @user.measurements.find_by(id: params[:id])
---
SELECT "measurements".* FROM "measurements" WHERE "measurements"."user_id" = ?  [["user_id", 1]]