app/controllers/api/users_controller.rb

	def create
		user = User.new(user_params)
		if user.save
---
INSERT INTO "users" ("first_name", "last_name", "gender", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def set_user
		user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]